{
	"patches": [
		{
			"num": "0",
			"name": "slightlyrandom",
			"type": "Sound source",
			"shortDesc": "Generative Synth ",
			"longDesc": "A self-playing sequence that is....you guessed it...slightly random",
			"controls": "Control page has visual indicators for all 3 elements of the patch with level control for each element and multiple parameter changes.  \n\nThe sequence tempo is controled via and LFO on the bottom left of page 0.   ",
			"btn1": "Mute Sequence",
			"btn2": "N/a",
			"cvIn1": "N/a",
			"cvIn2": "N/a",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "0-10V:  Trig Out (Also triggers FM pluck) ",
			"cvOut2": "0-10V:  Pitch out (follows FM sequence)",
			"cvOut3": "0-10V: ADSR out (same as Pad) ",
			"cvOut4": "0-10V: Bass Pitch Out",
			"midi": "N/a",
			"audioIn1": "Stereo In to Reverb, VCA lvl control",
			"audioIn2": "Stereo In to Reverb, VCA lvl control",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Benn Jordan"
		},
		{
			"num": "1",
			"name": "SWARM",
			"type": "Sound source",
			"shortDesc": "stereo swarm oscillator",
			"longDesc": "Loosely based on the Swarmatron, SWARM features eight sawtooth oscillators that can sound sweet and melodious or like a swarm of buzzing bees (or jackhammers).\n\nWhere the patch diverges significantly is the use of the stereo field:  SWARM's oscillators are sent, four to each output.  Then, different \"tilt\" controls can be applied -- these controls shape how controls and modulation are shaped across the stereo field.  The base \"volume tilt\" functions a little like a panner and a little like a filter, manipulating the amplitude of the oscillators to differing degrees, resulting in strange psychoacoustic effects.\n\nOther parameters (span, duty cycle, pitch modulation) can also be tilted, and creating swirling, cacophonous sounds (that are pretty hard to describe).",
			"controls": "The frequency of the oscillator can be set with the frequency control.  But this is only the frequency centerpoint.  Beside this control is the \"Span\" control, which spreads the oscillators over eight octaves (for those who wish to replicate the THX sound...).  Span (and other controls) are bipolar; by moving from negative to positive will cause the spread of to shift from left to right.\n\n\"Volume tilt\" likewise progressively dampens voices on one side or the other, so when the voices are near one another in pitch, this has a panning effect, but as the frequency is spread out, filter-like effects also become prevalent.\n\n\"Pitch mod tilt\" allows you to tilt the pitch modulation from the dedicated CV input.\n\nDuty cycle has its own modulation bus (because I ran out of inputs); you can select between a triangle wave LFO or a random module, controlling its rate, depth, and again tilt.\n\nEach individual voice has an on/off switch; use eight oscillators or one (or none, I guess).  Different arrangements of oscillators will produce chords and change the interplay of the modulation (especially with the XOR and ring mod options).\n\nThere is also a mixer section:  \"SWARM level\" controls the volume of the stereo swarm oscillator.  \"Ring level\" and \"XOR level\" use different processes (audio multiplication and XORing) to process each side of the stereo output against one another, but their outputs are mono, and they are sent to both outputs as dual mono.  Ring mod can be particularly interesting as the oscillators can delve into sub-audio rates.",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "0-10V:  Frequency",
			"cvIn2": "-5-5V:  Span (with attenuverter)",
			"cvIn3": "-5-5V:  Volume tilt (with attenuverter)",
			"cvIn4": "-5-5V: Pitch/frequency mod (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "2",
			"name": "Acid Wash",
			"type": "Sound source",
			"shortDesc": "self-playing, controllable acid synth",
			"longDesc": "Acid Wash is a four-part acid techno-inspired patch.  There is a bubbly, resonant lead, a rumbling sub, a tuned kick, and a hat.  There are smatterings of randomness spread throughout the patch to keep things interesting, and an output effects section of overdrive and bbd delay.",
			"controls": "Each part has its own level; the pixels in the center of the top two rows show how loud each voice is.  There are individual controls for things like the synth voice's envelope decay.  Two controls worth highlighting among the voices are the sub's \"sampling rate,\" which determines how often it changes notes, and the hat's \"open chance,\" which determines how often their decay is extended to simulate an open hi-hat.\n\nThere are controls for the overdrive gain, and the delay's feedback and mix (the delay time is a division of the clock).\n\nAcross the bottom two rows are controls for the eight steps of the sequence.  The top row defines the pitch; of note, negative values will produce random pitches (the range defined by the \"Low\" and \"High\" controls above and the key defined by the quantizer on the page labeled \"quant\").  There is also a control called \"octave chance\" which determines whether or not a note is randomly pushed up an octave.\n\nThe second row is labeled \"Mute - Glide\":  values below -A3 will mute that step (for the lead synth) and values above A3 will apply glide to that step.",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "N/a",
			"cvIn2": "N/a",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		},
		{
			"num": "3",
			"name": "FM drum kit",
			"type": "Sound source",
			"shortDesc": "FM drum kit",
			"longDesc": "Based on drum 3 from \"drumz not dead,\" this kit offers an expanded look at FM drum synthesis.  Drums one and two are (identical) FM'd square waves.  Drum three is an FM'd triangle wave, and drum four is an FM'd sine wave.  The first two work well for perc, the third for snares, and the last for basses and kicks.\n\nEach envelope produces an EOC gate at the CV outs, allowing for self-patching back into the gate inputs, for FM drones.",
			"controls": "Each voice has the same set of controls.  Of particular note:  \"mod offset\" controls the ratio of the modulator (as you may have seen this control in other FM synths) while \"Mod depth\" the gain of the modulator (also referred to as index in some FM synths).  \"Duty\" cycle can have interesting effects on the timbre at the extremes.\n\n\"Reverb\" controls both the mix and decay of the reverb lite a the output of the patch.\n\nThe buttons across the top both show when a drum is being triggered and can function as hands-on button control of the drums for audition or (I guess!) finger-drumming.",
			"btn1": "Not assigned (n/a)",
			"btn2": "N/a",
			"cvIn1": "0-10V:  drum 1 trigger",
			"cvIn2": "0-10V:  drum 2 trigger",
			"cvIn3": "0-10V:  drum 3 trigger",
			"cvIn4": "0-10V:  drum 4 trigger",
			"cvOut1": "0-10V:  drum 1 EOC gate",
			"cvOut2": "0-10V:  drum 2 EOC gate",
			"cvOut3": "0-10V:  drum 3 EOC gate",
			"cvOut4": "0-10V:  drum 4 EOC gate",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		},
		{
			"num": "4",
			"name": "1Volt Chord",
			"type": "Sound source",
			"shortDesc": "paraphonic FM pad",
			"longDesc": "Designed for easily triggering chords with a single trig and pitch input.  Select the desired key on first page and send in the root note of the chord you want to play and ZOIA does the rest - triggering a quantized triad.",
			"controls": "Play chords with a signle pushbutton using the keyboard in the middle of the control page.  Keyboard will override incoming triggers and v/oct. \n\nSelecting a note on quantizer under the keyboard will quantize all notes to the selected key.  Quantizers default to the major scale but all 3 quanitzers can be changed on page 4, labeled \"quantizers\".  ",
			"btn1": "FM ratio 2-1; latching switch changes the FM ratio",
			"btn2": "Operator shift; increase the pitch of the opterator by 1 v-oct",
			"cvIn1": "0-10V:  Pitch Root Note (frequency input)",
			"cvIn2": "0-10V: gate; envelope is held for the amount of time the gate is sent",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "0-10V:  Env out",
			"cvOut2": "0-10V:  root note out",
			"cvOut3": "0-10V:  3rd out",
			"cvOut4": "0-10V:  5th out",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Mitch Lantz"
		},
		{
			"num": "5",
			"name": "MultiVox",
			"type": "Sound source",
			"shortDesc": "polyphonic strum synth/chord sequencer/quantizer",
			"longDesc": "MultiVox can serve a variety of functions.  At its heart, it is a chord synth voice, generating chords from a single note.  The notes of these chords are also produced at the CV output, making MultiVox a means of storing chords for polyphonic purposes in a modular system.  The chords can also be strummed -- the changes in notes spread out over time, allowing for cascading changes in note progression.",
			"controls": "On the second page are three sets of controls that will determine how the synth performs; they are labeled \"local\" and sit above the note, chord, and trigger CV inputs.  When they are on, the patch is controlled internally, by the keyboard modules on the first page.  When they are off, the patch is controlled via CV.  You can mix and match as you please.\n\nThe two keyboards on the first page allow you to select the root note of a chord (blue keyboard) and the chord type (yellow keyboard).  There are also controls across the top.  \"Invert\" will invert the chord.  \"Spread\" allows you to spread out the chord (strum).  The lights across the top show when each internal voice is active; pressing them will mute that particular voice.  \"Random chord\" selects a new chord randomly when \"local\" is on.  \"Loop\" allows you to loop the synth when \"local\" is on.\n\nOn the second page are the banks for each chord.  Also, in the top right corner are controls for the attack and decay of the internal voice's envelope.\n\nOn the third page is the quantizer (default A natural minor) and the delay used to output the internal voice.",
			"btn1": "Trigger (momentary); will trigger the internal voice when \"local\" is on",
			"btn2": "Tap tempo (momentary); tap tempo for the delay",
			"cvIn1": "0-10V:  Note (frequency input)",
			"cvIn2": "0-5V:  Chord (select between one of eight chord types)",
			"cvIn3": "0-10V:  Trigger",
			"cvIn4": "N/a",
			"cvOut1": "0-10V:  Note 1 output",
			"cvOut2": "0-10V:  Note 2 output",
			"cvOut3": "0-10V:  Note 3 output",
			"cvOut4": "0-10V:  Note 4 output",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		},
		{
			"num": "6",
			"name": "Shim Shim Meree",
			"type": "Effect",
			"shortDesc": "dual pitch-shifting reverb",
			"longDesc": "Two granular pitchshifters are placed in the regeneration loop of a plate reverb, allowing for shimmer reverbs, sub-octave reverbs, and reverbs which blend the two together in interesting ways.  Because the pitchshifters can be set to separate pitches and given different weight with a balance control, more complex pitch interactions can occur.",
			"controls": "\"Decay\" sets the decay of the reverb.  Separate \"Wet\" and \"Dry\" levels allow for the two to be controlled independently.\n\n\"Pitch amount\" determines how much of the pitchshifting is introduced into the feedback loop of the reverb, from none to quite a lot -- this control also affects the decay of the reverb.  The \"Character\" control is a macro, which determines several settings on the granular modules; lower values will result in a grainier result which will enter the regeneration loop quickly, while higher settings will be smoother but have a longer onset period.\n\n\"Pitch 1\" sets the pitch of one of the pitchshifters; \"Pitch 2\" sets the pitch of the other.  The \"Balance\" control determines the balance between the two pitches, with low values favoring pitch 1 and high values favoring pitch 2.",
			"btn1": "Capture (latching); this freezes the reverb and cuts off its input, great for creating pads and soundscapes -- in certain settings, the regeneration will begin to increase in gain over time",
			"btn2": "Freeze (momentary); freezes the reverb but does not cut off the input",
			"cvIn1": "0-5V:  Balance (attenuverter available)",
			"cvIn2": "0-5V:  Decay (attenuverter available)",
			"cvIn3": "0-5V:  Wet level (attenuverter available)",
			"cvIn4": "0-10V:  Reverb freeze",
			"cvOut1": "Not assigned",
			"cvOut2": "Not assigned",
			"cvOut3": "Not assigned",
			"cvOut4": "Not assigned",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "7",
			"name": "Space4rent",
			"type": "Effect",
			"shortDesc": "reverse pitch-shifting delay/reverb",
			"longDesc": "Using loopers to create reversed delays, Space4rent allows you to play with time and space.  There is a plate reverb, which can either be placed before or after the reverse delay (think grainy textures for before and big ambient drones for after).  Each side of the delay can be independently pitched, and the feedback ping-pongs between each side, allowing for swirling pitched repeats.  There is also a four-step pitch sequencer (applied to both sides) to allow for more rhythmic variations in playback speed.  Perfect for adding a bit of weird pizzazz to percussion tracks and dreamy ambience to melodic sequences.",
			"controls": "There is a control for the compressor threshold (I found placing a compressor after the reversed loops made them feel a little smoother), as well as mix and decay controls for the reverb.\n\nThe delay has a feedback control.  It also has low- and high-cut controls; the filters for these are placed within the feedback path, so they will affect the strength of the regeneration (to compensate for this, the gain of the feedback path can go above unity in some settings, producing oscillation, so be careful).\n\nThere is a pre-routed pitch modulation (sine wave).  There are also controls for each step of the sequencer, as well as independent speed-pitch controls for each channel.\n\nAlong the bottom are wet and dry levels, as well as a button (also in the stickies) which will switch the order of the reverb and delay:  aqua = reverb > delay; white = delay > reverb.",
			"btn1": "Tap tempo (overriden by clock in)",
			"btn2": "Order switch (condition reflected in UI button on control page)",
			"cvIn1": "0-10V:  Clock in",
			"cvIn2": "0-5V:  Reverb mix (with attenuverter)",
			"cvIn3": "-5-5V:  Speed-pitch mod (with attenuator)",
			"cvIn4": "0-5V:  Wet level (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "8",
			"name": "Stretch Repeat",
			"type": "Effect",
			"shortDesc": "side-chaining pitch-shifting looper",
			"longDesc": "The two channels of the patch can be used dynamically to cause the other to loop and shift in pitch, either immediately or over time, resulting in sounds like a speeding up or slowing down tape.\n\nCV can also be employed to produce looping, or the channel's own dynamics can cause it to loop as it exceeds a volume threshold.",
			"controls": "Each side of the patch has its own controls for threshold.  There are also controls for pitch, pitch rate (which determines how quickly the pitch changes once the threshold is crossed), and an envelope button, which will add a volume envelope to each loop.  There are also wet and dry levels for each side.\n\nA global control for loop speed is shared between the two sides.  Below it is a release control, which can be used to keep a threshold open -- employ it if your loops are too choppy.\n\nIn the middle of the page is a pushbutton matrix to determine what will cause each side to loop:  \"side or self\" determines whether it is the other side/channel of the patch which will cause looping or the same side (self).  Audio or CV determines whether it will be audio or CV that produces the looping.",
			"btn1": "Loop L (will cause the left side to loop)",
			"btn2": "Loop R (will cause the right side to loop)",
			"cvIn1": "0-5V:  Left trigger in (named because it can be used to trigger the looping, not because it expects a trigger)",
			"cvIn2": "0-5V:  Right trigger in",
			"cvIn3": "0-5V:  Loop length (with attenuverter)",
			"cvIn4": "N/a",
			"cvOut1": "0-5V:  Left envelope follower out",
			"cvOut2": "0-5V:  Right envelope follower out",
			"cvOut3": "0-10V:  Left threshold out",
			"cvOut4": "0-10V:  Right threshold out",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "9",
			"name": "Non linear",
			"type": "Effect",
			"shortDesc": "a non linear stereo reverb",
			"longDesc": "Non linear wraps a reverb in dynamically induced envelopes, allowing you to generate gated reverbs, reverse reverbs, and even more exotic fare.  A LPF-HPF filter (with resonance) then allows even more shaping of the sound, accenting and damping different spectra.\n\nDynamics are generated from the left input only.",
			"controls": "The most important control is put first:  threshold.  This defines the point at which the envelopes are generated; depending on your source, it may take some dialing in.\n\nThen there are envelope controls.  There are two types of envelopes:  static or fixed, produced by an onset detector, and dynamic, based on an envelope follower.  The controls for the envelope change slightly, depending on whether the envelope is static or dynamic.  Attack and release remain the same in both conditions and are limited to 6 seconds.  Hold changes, depending on the type of envelope:  in static, it determines the entire length of the hold section, while in dynamic it determines how long the envelope is held after the input has dropped below the threshold.\n\nPre-delay allows up to 1 second of pre-delay.  Reverb decay determines the decay of the reverb and can affect the character of the non linear reverb.  LPF-HPF frequency is continuous, with negative numbers getting progressively more low-passed and positive numbers getting progressively high-passed.  Resonance is somewhat attenuated, but it can get very resonant.\n\nThere are a series of buttons below this:  \"Static-dynamic\" determines which source generates the envelope.  \"Retrigger\" determines whether the envelope is retriggered from its current position (off) or from a 0 position (on) (this will have the greatest effect with static envelopes).  \"Gate input\" and \"gate output\" determine whether the envelope is applied to the input of the reverb, the output of the reverb, both, or neither (neither results in a filtered plate reverb, which may be useful in some applications).  \"Clear buffer\" determines whether the reverb's buffer is cleared between envelopes, which can make each instance sound more isolated and alien.\n\nFinally, at the bottom are controls for wet and dry level.  The wet level has been somewhat amplified to compensate for the reduction in volume caused by the envelopes.",
			"btn1": "Static-dynamic; switches envelope types (paralleled on the control page; the UI button on this page will change color to reflect the type chosen -- yellow for static, aqua for dynamic)",
			"btn2": "N/a",
			"cvIn1": "N/a",
			"cvIn2": "0-5V:  Attack (with attenuverter)",
			"cvIn3": "0-5V:  LPF-HPF frequency (with attenuverter)",
			"cvIn4": "0-5V:  Wet level (with attenuverter)",
			"cvOut1": "0-5V:  Envelope out",
			"cvOut2": "0-10V:  Onset detector trigger out",
			"cvOut3": "0-5V:  Envelope follower out",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In; used in dynamic generation",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "10",
			"name": "Upwards",
			"type": "Effect",
			"shortDesc": "barberpole ring mod delay",
			"longDesc": "A barberpole ring mod feeds into a delay, with a flexible feedback path.  Since the ring mod oscillator can drop into the sub-audio range, the patch produces all kinds of AM modulation, from distorted ring mods to phasing tremolos.\n\nThe inputs sum to mono before producing a stereo output.",
			"controls": "The \"ring mod freq\" controls the base frequency of the ring mod oscillator.  The \"depth\" and \"rate\" pertain to the barberpole/Shepard tone modulation -- in these cases, \"low and slow\" pays off for the best rising, falling effects, with a slow rate and a low depth (not more than two octaves).  There is a \"ring mod mix\" to allow you to mix the ring mod with your dry signal before it hits the delay.\n\nThe delay controls include mod rate and depth for the modulation, but the feedback is externally routed, with the \"feedback path\" control determining whether the feedback is routed to the delay (0) or the ring mod (1), with points in between available.  The mix of the delay can be set, too, allow you to take it out of the picture or produce phase/comb filtering effects through feedback.\n\nFinally there are controls for dry and wet level.",
			"btn1": "Tap tempo for delay",
			"btn2": "Maxes feedback",
			"cvIn1": "0-10V:  Delay clock (overrides tap tempo)",
			"cvIn2": "0-5V:  Freq volt/octave tracking for the ring mod oscillator.",
			"cvIn3": "0-5V:  Delay mix (with attenuverter)",
			"cvIn4": "0-10V:  Freq mod clock (as the frequency modulation benefits from slow speeds, there is a clock divider at this input, which is located on the page marked \"freq mod clock\" and has also been **starred**)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "11",
			"name": "Grains de folie",
			"type": "Effect",
			"shortDesc": "parallel granular delay",
			"longDesc": "Grains de folie -- touches of madness -- processes your audio through four granular modules per side, running in parallel with one another, creating swelling rhythmic sounds, clouds of pointillistic pitch changes, shuffling stutters, and odd combinations of the former and more.",
			"controls": "Each of the granular modules has an independent pitch control.  Beside this is pitch modulation section, with choices of square, sine, random, and CV input 4.\n\nThere are global controls for grain size, density and texture.\n\nThe \"phase\" section controls the position of the grains.  The \"phase\" control spreads the grains out evenly; the phase mod option changes the position control to a triangular LFO, each randomly sped to each grain.\n\nThe grains can be randomly frozen (one at a time).  There is a pushbutton to intiate this, and two options for clocking the random changes (via tap tempo button or CV clock).\n\nThere are wet and dry level controls, but there is also a control to cross-feed, with grains 1&2 from the left side fed into grains 3&4 from the right side and vice versa.",
			"btn1": "Random freeze tap tempo",
			"btn2": "Phase mod (selects between spread and modulated phase)",
			"cvIn1": "-5-5v:  Grain size (with attenuverter)",
			"cvIn2": "N/a",
			"cvIn3": "0-10V:  Random freeze clock",
			"cvIn4": "-5-5V:  Pitch mod (selected via button at the top of the page and controlled by the pitch mod depth)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "12",
			"name": "PhaDelRevDry",
			"type": "Effect",
			"shortDesc": "phaser, delay, reverb and dry",
			"longDesc": "A straightfoward patch running 3 effects and the dry signal in parallel with a switch to run the effects in series.  ",
			"controls": "Level bushbuttons control the levels for each effect and the dry signal.  When the series pushbotton is engaged the effect route in series instead of parallel. Routing in series changes the level bushbottons from level controls to mix controls for the phaser, delay and reverb, the level for the dry is alwasy a level control. \nLFO on second patch controls internal tap tempo when user button 2 is not engaged.  ",
			"btn1": "Effects in series; changes effects from a parallel routing where nothing interacts to series with the phaser into delay into reverb. ",
			"btn2": "external clock on; switches from interal to external clock ",
			"cvIn1": "0-10v: clock input",
			"cvIn2": "N/a",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "0-10v: Clock output; outputs the selected clock based on user button 2",
			"cvOut2": "",
			"cvOut3": "",
			"cvOut4": "",
			"midi": "",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Benn Jordan + Mitch Lantz"
		},
		{
			"num": "13",
			"name": "MicroSounds",
			"type": "Effect",
			"shortDesc": "dual stereo granular engine",
			"longDesc": "Microsounds is a series/parallel dual granular engine, designed to produce granularized sound from the delicate to the destroyed.  The pitch of each module is linked, so that as one goes up, the other goes down.  Audio feeds into the first granular module, and the outputs of both modules are summed to produce the effect.  Audio can also be fed back or processed by a reverb lite.",
			"controls": "Each granular module has independent grain size and position controls.  The pitch controls the pitch of the first granular module and the inversion of that pitch in the second granular module.  Texture and density controls are shared.\n\nThere are three level controls:  dry level, granular level, and reverb level.  The granular modules can be fed back into one another (granular 2 --> granular 1), and there is a control for this (be cautious; in certain settings it can overwhelm the circuit).  The reverb has a decay control.",
			"btn1": "Granular 1 freeze (latching)",
			"btn2": "Granular 2 freeze (latching)",
			"cvIn1": "0-5V:  Granular level (with attenuverter)",
			"cvIn2": "0-5V:  Reverb level (with attenuverter)",
			"cvIn3": "0-5V:  Granular position 1 (with attenuverter)",
			"cvIn4": "0-5V:  Granular position 2 (with attenuverter)",
			"cvOut1": "No assignment",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "14",
			"name": "Airport Loops V2",
			"type": "Effect",
			"shortDesc": "four unsynchronized loopers with extensive control UI",
			"longDesc": "Inspired by Brian Eno's Music for Airports, airport loops is a composition and performance tool for recording, manipulating, and mixing asynchronous loops.  A mix of global controls and individual controls for the loops allows you to quickly create evolving compositions.\n\nPorted from ZOIA, extensive patch notes can be found at:  https://patchstorage.com/airport-loops-four-unsynchronized-loopers-for-experimentation/",
			"controls": "There are two control pages.  The first, which the patch loads on, is used for recording loops, via the pushbuttons on the page, and for global controls (level, tape speed, tape age, corrosion; the latter two are used to degrade the quality of the loops).\n\nThe second page gives you comprehensive control over the loops (pitch, reverse, start, end, tape age) on the left side, as well as a simplified mixing desk on the right, with mutes (these are automated, with fade in/out times set by the control below), level, a reverb send, and pan position for each loop.",
			"btn1": "Maxes the reverb decay",
			"btn2": "Must be used in performance mode (hold shift and press the back button until it turns magenta):  performance transpose -- when this button is held, changes to the individual loop pitch will not take effect until it is released, allowing you to repitch loops without hearing the transition between pitches",
			"cvIn1": "0-5V:  level (with attenuverter)",
			"cvIn2": "-5-5V:  tape speed (with attenuverter)",
			"cvIn3": "0-5V:  tape age (with attenuverter)",
			"cvIn4": "0-5V:  corrosion (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "15",
			"name": "Phase drag",
			"type": "Effect",
			"shortDesc": "mono-to-stereo phase-delay-panner",
			"longDesc": "Perfect for that Kautrock/Berlin school session, Phase drag features clocked-synced phaser, delay, and panning to create swirling and drifting phased sounds. The effects are clock-synced, each with its own clock divider, allowing for a wide variety of rhythmic interaction between the three. ",
			"controls": "The controls are fairly common ones to these effects.  Of particular note:  the phaser width is on a -1 to 1 value module; positive values produce classic phasing (warmer, chewier) while negative values produce inverted phasing (more metallic, nasal).  The \"pan offset\" allows the panning LFO to be placed off-center in phase, for even more interactions between it and the phaser's modulation.\n\nIn the center of the first page are labeled clock dividers for each effect.  (These clocks are sequentially converted to CV to allow for more manipulation.)",
			"btn1": "Tap tempo (momentary)",
			"btn2": "Stages; selects between 3 and 6 stage phasing (latching)",
			"cvIn1": "0-10V:  Clock (affects the speed of all devices)",
			"cvIn2": "0-5V:  Phase width (with attenuverter); this can be used to replace the internal modulation when the phase width control is set to 0 or to augment it when in other positions",
			"cvIn3": "0-5V:  Resonance (with attenuverter)",
			"cvIn4": "-5-5V:  Pan (with attenuator); this can be used to replace the internal modulation when pan spread is set to 0 or to augment it when in other positions",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "16",
			"name": "Tape Return",
			"type": "Effect",
			"shortDesc": "tape delay/loop degradation",
			"longDesc": "Using a delay, rather than a looper, Tape Return aims to recall the eccentricities, imprecision, and degradation of the tape loop, Frippertronics, and Basinki.  Loops slowly (or quickly) degrade into broken, smeared, mangled remnants of their former selves.  Or it can be used as a (massively long, up to 32 seconds) delay, if you want.",
			"controls": "In the top left corner are two sets of decay controls; one for delay, and one for loops.  Between them is a button (mirrored in the user buttons and via CV) which will select whether the patch functions as a delay or as a looper.  When audio is looped, the input to the delay is closed.\n\nIn the top right corner are wet and dry level controls.\n\nOn the next row are controls over the delay time:  a tap tempo button (the patch also accepts clock; there is a clock divider *starred*; note that the at 1/1, clock will be twice as long as what is received, since the signal is sent to two delay lines).  There is also a time control, which can be used in lieu of clock (and my own recommended method, but people like clocking things).  Beside these are a control for \"time lag\" and \"time lag speed\" -- time lag allows you to add or subtract time from the loop, resulting in pitch/sample rate changes; the speed control is for a CV filter that slows down changes in speed.\n\nBelow these are controls for damaging the loops:  tape age (delay speed noise modulation), corrosion (amplitude noise modulation), mod (sine wave delay speed modulation), diffusion (for smearing out sound), high cut (a non-resonant low-pass filter placed in the feedback path; adjusting this may result in clicking sounds).  There is also a post-loop resonant HPF-LPF for shaping the tone of the loop.\n\nFinally, there are controls for introducing new elements into the loop:  \"Add\" (or overdub) and \"Replace\" (replace the existing audio) both share a \"fade time\" control, which allows you to fade new audio in or out.  There is also a \"rub tape\" button, which will rub away part of the loop.  Finally, a pushbutton lets you decide if you want to kill the dry signal when switching between delay and looped audio.",
			"btn1": "Switch between delay and loop",
			"btn2": "Add (overdub) audio to the loop",
			"cvIn1": "0-10V:  Clock in",
			"cvIn2": "-5-5V:  LPF-HPF frequency (with attenuverter)",
			"cvIn3": "-5-5V:  Time lag (with attenuverter)",
			"cvIn4": "0-10V:  Switch between delay and loop (with gate or trigger)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "17",
			"name": "Degenerate Gain V3",
			"type": "Effect",
			"shortDesc": "highly modulatable lo-fi vibrato",
			"longDesc": "Inspired by a popular collaboration, Degenerate Gain asks:  what if you want your sound to sound not as good?  Combining vibrato with FM style modulation, sample rate reduction, filtering and noise-driven AM modulation, Degenerate Gain can take something fresh and new and make it grody... in a good way!\n\nPorted from ZOIA, extensive patch notes can be found at:  https://patchstorage.com/degenerate-gain-a-naggingly-familiar-stereo-lo-fi-generator/",
			"controls": "Each control (wow, flutter, wet level, gen/aliaser frequency, hpf frequency, lpf frequency, corrosion, and noise level) has an individual on/off and depth control (attenuverter) for modulation.  There is also a dry level control and the option to choose between \"pink\" or white noise.\n\nBelow these, buttons allow yout select the modulation source from each of the CV inputs as well as an envelope follower taken from the left input).  The button will change colors to reflect the source chosen.",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "0-5V:  CV input 1 (assignable on the control page)",
			"cvIn2": "0-5V:  CV input 2",
			"cvIn3": "0-5V:  CV input 3",
			"cvIn4": "0-5V:  CV input 4",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "18",
			"name": "destroyyy",
			"type": "Effect",
			"shortDesc": "dual fuzz/filter",
			"longDesc": "destroyyy combines filtering, fuzz, compression, and bit crushing to totally decimate your signal.  The input signal is monitored by envelope followers, which can be routed to the LPF, HPF, or both (for moving bandpass).  To round things out, there is a variable feedback path, that can route the output back into signal path either pre-LPF or post-LPF (or a mixture of both).\n\nGet destructive.",
			"controls": "The controls across the top of the page roughly mirror the signal path, beginning with LPF frequency and resonance, before moving to fuzz input and output gain, then bit crush amount, compression threshold, and finally HPF frequency and resonance.  Of particular note, the compression threshold can work as a wet signal level control.\n\nBelow these are controls for the feedback path.  A value of 0 for the feedback path control will route the output pre-LPF, 1 will route it post-LPF, while values between will send feedback both pre- and post-LPF.  (Practice caution with the feedback control -- it can get loud!  The whole patch can get loud, but this especially.)\n\nOn the next row are controls for the envelope followers, including how they are routed to the filters as well as attack and decay controls for them.\n\nFinally, there is a dry level.",
			"btn1": "Limit -- latching, this aggressively changes the compression ratio to tamp down spiking volume",
			"btn2": "N/a",
			"cvIn1": "0-5V:  LPF frequency (with attenuverter)",
			"cvIn2": "0-5V:  HPF frequency (with attenuverter)",
			"cvIn3": "0-5V:  Resonance (routed to both filters' resonances, with attenuverter)",
			"cvIn4": "0-5V:  Feedback (with attenuverter)",
			"cvOut1": "0-5V:  Left envelope follower",
			"cvOut2": "0-5V:  Right envelope follower",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "19",
			"name": "Duck duck drive",
			"type": "Effect",
			"shortDesc": "ducked distorted reverb",
			"longDesc": "Input dynamics drive a ducked reverb.  With the ability to shape the input envelope and distort the reverb tails, all sorts of strange, side-chaining effects can be created.",
			"controls": "Across the top are controls for the reverb decay and tone (the tone control is a tilt EQ, so negative numbers are darker and positive numbers are brighter).  The next row is the drive (input gain) control for the distortion (pushed, which has a nice compressed sound).\n\nThe envelope followers can be shaped, with added attack and decay to draw the stages out.  The duck amount can go from subtle to very severe, totally suppressing the wet signal.\n\nThere are wet and dry levels (although the drive amount and duck amount will both affect the wet level).",
			"btn1": "Reverb freeze (momentary)",
			"btn2": "Stereo or left (latching); this button chooses whether right side is controled by its own envelope follower (stereo) or the left side's; since the reverb is a stereo effect, sometimes using independent envelope followers can produce odd results",
			"cvIn1": "-5-5V:  Reverb decay (with attenuverter)",
			"cvIn2": "-5-5V:  Drive (with attenuverter)",
			"cvIn3": "-5-5V:  Envelope follower attack (with attenuverter)",
			"cvIn4": "-5-5V:  Duck amount (with attenuverter)",
			"cvOut1": "0-5V:  Left envelope follower out",
			"cvOut2": "0-5V:  Right envelope follower out",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "20",
			"name": "Resoverb",
			"type": "Effect",
			"shortDesc": "resonant resynthesis 'verb",
			"longDesc": "Three resonant comb filters resynthesize the input signal, before passing to a multi-tap delay network, resonant lowpass-highpass filter, and reverb (lite).  Perfect for creating haunting accompaniment.",
			"controls": "Each of the resonant filters' frequencies can be changed (lower values produce higher frequencies and vice versa).Each filter also has a momentary pushbutton beneath it, allowing you to max its feedback and push it to self-oscillate.  The filters share a feedback control, otherwise.\nThe multi-tap network can be used as an additional comb network when set to a low time value (it maxes out at ~1.5 seconds) and a high feedback.  It can also be used to increase the sense of space.\nThe resonant lowpass-highpass sweepable filter allows you accentuate certain frequencies, while the reverb decay allows you to extend the sounds of the resynthesis engine.\nThere are separate wet and dry level controls.",
			"btn1": "Not assigned (n/a)",
			"btn2": "N/a",
			"cvIn1": "0-5V:  Resonator frequency (affects all resonators, meant for modulation more than pitch; with attenuverter)",
			"cvIn2": "0-5V:  Resonator feedback (with attenuverter)",
			"cvIn3": "0-5V:  Lowpass-highpass frequency (with attenuverter)",
			"cvIn4": "0-5V:  Reverb decay (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "21",
			"name": "Filter Twins",
			"type": "Effect",
			"shortDesc": "dual mono/stereo configurable filter with separation",
			"longDesc": "Filter twins allows you to configure filters as independent mono pairs or as a stereo set.  On each side, the filters can be figured as 12 dB/octave LP, BP, and HP filters, or as any combination of 6 dB filters, and they can run in series or parallel.  Since each side's filter is actually the result of two filters operating in unison, you can also separate the cutoff frequency of each.\n\nIn stereo, the same possibilities arise but you can also separate the stereo filters' cutoff, resulting in a wide array of filtering possibilities.",
			"controls": "Across the top are controls for each side's filter:  frequency, resonance, and freq separation.  Below this are buttons to configure the filters' toplogy as well as whether they run in series or parallel.\n\nIn the center is a stereo link button; when lit the filters mirror one another, with the left side's controls becoming master controls for both channels.  A stereo separation control also becomes available at this point.",
			"btn1": "Stereo link (replicated on front page)",
			"btn2": "N/a",
			"cvIn1": "-5-5V:  (Dual mono)  Left frequency (with attenuverter)\n\n(Stereo)  Frequency (with attenuverter)",
			"cvIn2": "-5-5V:  (Dual mono) Left filter frequency separation (with attenuverter)\n\n(Stereo) Filter frequency separation (with attenuverter)",
			"cvIn3": "-5-5V:  (Dual mono) Right frequency (with attenuverter)\n\n(Stereo)  Stereo filter separation (with attenuverter)",
			"cvIn4": "-5-5V: (Dual mono) Right filter frequency separation (with attenuverter)\n\n(Stereo)  Resonance (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "22",
			"name": "DigiOp",
			"type": "Sound Source",
			"shortDesc": "FM, polyphonic, lofi",
			"longDesc": "FM 4-operator synthesis with lo-fi effects.",
			"controls": "ADSR envelope, FM amount, diffuser mod/feedback/size, LFO rate/depth, external input level.",
			"btn1": "Tap Tempo: LFO tap",
			"btn2": "N/a",
			"cvIn1": "0-10V: Pitch",
			"cvIn2": "0-10V: Gate, includes 2/8 clock filter",
			"cvIn3": "0-10V: Pulse-width modulation",
			"cvIn4": "0-10V: Clock, includes 2/8 clock filter",
			"cvOut1": "0-10V: Stepped lfo",
			"cvOut2": "0-10V: Slewed lfo",
			"cvOut3": "0-10V: ADSR stack",
			"cvOut4": "N/a",
			"midi": "Notes and gate.",
			"audioIn1": "Fx in",
			"audioIn2": "Fx in",
			"audioOut1": " Out",
			"audioOut2": "Out",
			"author": "Mike Moger"
		},
		{
			"num": "23",
			"name": "Quantize and Play",
			"type": "Sound Source",
			"shortDesc": "keyboard synth Effect: delay and reverb",
			"longDesc": "A keyboard playable dual oscillator synth patch, containing a pad and a seuqnece going into delay and reverb.  Audio from the audio input is also routed to the effects. ",
			"controls": "Keyboard with quantizer on botton of control page.  Sequence and keyboard will quantize to selected scale, note selected on keyboard will play the closest note in the scale.  Separte pushbuttons to pitch up the sequence and the pad.",
			"btn1": "Trig: Trigger last selected note from keyboard",
			"btn2": "N/a",
			"cvIn1": "N/a",
			"cvIn2": "N/a",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "0-10V: v-oct sequence out; quantized pitch data from sequence",
			"cvOut2": "0-10V: Quantized pitch, note from keyboard out",
			"cvOut3": "0-10V: Envelope out",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "To FX send",
			"audioIn2": "To FX send",
			"audioOut1": " Out",
			"audioOut2": "Out",
			"author": "Mitch Lantz"
		},
		{
			"num": "24",
			"name": "Skating alone",
			"type": "Sound Source",
			"shortDesc": "Generative Synth",
			"longDesc": "LFO controlled and randomized generative sequence with LFO outputs ",
			"controls": "Reverb mix and decay, delay mix and decay, LFO rate and quantizers",
			"btn1": "LFO Phase Reset",
			"btn2": "N/a",
			"cvIn1": "0-10v: phase reset",
			"cvIn2": "N/a",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "0-10V: LFO 1",
			"cvOut2": "0-10V: LFO 2",
			"cvOut3": "0-10V: LFO 3",
			"cvOut4": "0-10V: LFO 4",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": " Out",
			"audioOut2": "Out",
			"author": "Benn Jordan"
		},
		{
			"num": "25",
			"name": "drumz not dead",
			"type": "Sound source",
			"shortDesc": "drum kit",
			"longDesc": "A four-voice drum kit based on a variety of synthesis methods, controlled gate input or a set of pushbuttons on the second page, which then passes through a reverb lite to add \"space.\"  Drum one, based on a resonant filter, is designed for kicks and toms.  Drum 2, based on granularized noise, can perform a variety of duties, but specializes in snares and perc.  Drum three, based on FM'd square waves, also excels at snares and perc.  Drum 4, based on filtered noise, works well for hats and cymbals.\n\nEach drum has a UI-button fader to allow you to quickly control the mix.",
			"controls": "Each drum has a set of individualized controls that govern its timbre, along with controls for that voices attack/decay envelope.\n\nNext to each control is a vertical row of UI buttons that act as a level fader (four increments and off, at the bottom) for that voice, providing a very simple mixer.",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "0-10V:  drum 1 trigger",
			"cvIn2": "0-10V:  drum 2 trigger",
			"cvIn3": "0-10V:  drum 3 trigger",
			"cvIn4": "0-10V:  drum 4 trigger",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "",
			"audioIn2": "",
			"audioOut1": "",
			"audioOut2": "",
			"author": "Christopher Jacques"
		},
		{
			"num": "26",
			"name": "DZO ",
			"type": "Sound Source",
			"shortDesc": "dual ZOIA oscillator, paraphonic",
			"longDesc": "Two oscillators, using the same CV/gate or MIDI source, run in parallel with FM options, offset modulation, and effects.",
			"controls": "For each operator: UI buttons for oscillator shape, ADSR envelope, FM mix (internal or external), and mod offsets. Overall mod range, quantizer key/scale, LPF (+ minimum bias), and, reverb.",
			"btn1": "Tap Tempo: clock source",
			"btn2": "LFO: toggles presence of external LFO",
			"cvIn1": "0-10V: pitch CV",
			"cvIn2": "0-10V: gate CV, includes 2/8 clock filter",
			"cvIn3": "0-10V: FM amount",
			"cvIn4": "0-10V: Clock, includes 2/8 clock filter",
			"cvOut1": "0-10V: Clock out",
			"cvOut2": "0-10V: Quantized pitch",
			"cvOut3": "0-5V: Triangle LFO (pb)",
			"cvOut4": "N/a",
			"midi": "Notes, gate, and pitchbend.",
			"audioIn1": "FM external input for operator 1",
			"audioIn2": "FM external input for operator 2",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Mike Moger"
		},
		{
			"num": "27",
			"name": "NARCC",
			"type": "Sound Source",
			"shortDesc": "pinged filters, pitch shifting, looper, reverb",
			"longDesc": "Inspired by Rings into Clouds. Pinged BP filters into looped, reverberated bliss.",
			"controls": "ADSR envelope, resonance for BP filters, amount of noise in exciter, external input level, feedback, bpf cutoff, looper pitch, reverb mix, mod depth, and external mod amount.",
			"btn1": "Tap Tempo: Looper automated recording time",
			"btn2": "N/a",
			"cvIn1": "0-10V: Pitch",
			"cvIn2": "0-10V: Gate, includes 2/8 clock filter",
			"cvIn3": "0-10V: External modulation (+ atten)",
			"cvIn4": "0-10V: Clock, includes 2/8 clock filter",
			"cvOut1": "0-10V: Looper EOC",
			"cvOut2": "0-10V: ADSR envelope",
			"cvOut3": "0-10V: Mod output",
			"cvOut4": "N/a",
			"midi": "Notes and gate.",
			"audioIn1": "Fx in",
			"audioIn2": "Fx in",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Mike Moger"
		},
		{
			"num": "28",
			"name": "Modulate This",
			"type": "Sound source",
			"shortDesc": "modal synthesis voice",
			"longDesc": "An exciter is passed through a bank of resonators (parallel bandpass filters) to create a simple but flexible modal voice -- for creating drums, digeridoos, whistles, scraping glass, etc., along with some otherworldly sounds.\n\nThe voice can be panned before passing through a hall reverb to give it a feeling of place.",
			"controls": "The controls break down into three sections:\n\nOn the left are controls for the exciter, with a frequency control for the sawtooth oscillator (when chosen), an aliaser frequency (applies to both noise and sawtooth for some variety, can produce a sort of \"granular\" noise when set to low frequencies), and a level for the exciter (which doubles as a level for the patch).  Beneath these are controls for the ADSR which controls how the exciter is fed into the resonators.\n\nOn the right are controls for the resonators.  There is a frequency control, for setting the base frequency of the voice, a resonance control which applies to all filters and changes the timbre and decay of the voice, and nine \"overtone\" controls which set the frequency of the filters relative to the base frequency (there is a tenth filter which is always assigned to the base frequency).\n\nIn the middle are controls for the output stage:  pan, reverb decay, and reverb mix.",
			"btn1": "Exciter source (latching, selects between noise -- dim/off -- and sawtooth oscillator -- bright/on).",
			"btn2": "Gate (momentary, doubles the gate CV input for the exciter ADSR)",
			"cvIn1": "0-10:  Frequency (controls the base frequency of the resonators, relative to the frequency set on the control page); tracks V/oct",
			"cvIn2": "0-10V:  Gate (controls the exciter's ADSR)",
			"cvIn3": "0-5V:  Frequency mod (with attenuverter)",
			"cvIn4": "0-5V:  Pan (with attenuverter)",
			"cvOut1": "0-5V:  Exciter ADSR (I like to self-patch this to the pan or frequency mod inputs)",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "",
			"audioIn1": "",
			"audioIn2": "",
			"audioOut1": "",
			"audioOut2": "",
			"author": "Christopher Jacques"
		},
		{
			"num": "29",
			"name": "Risers",
			"type": "Sound Source",
			"shortDesc": "Pitch Risers",
			"longDesc": "An exploration of different ways to make risers with the ZOIA containing 4 different risers.  Cause who wants to use up a bunch of modules for risers? ",
			"controls": "Each riser has controls over the beginning pitch, the pitch amount and the time.  Triggered via pushbuttons or CV inputs ",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "0-10v: trig riser 1",
			"cvIn2": "0-10v: trig riser 2",
			"cvIn3": "0-10v: trig riser 3",
			"cvIn4": "0-10v: trig riser 4",
			"cvOut1": "0-10V: LFO 1",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": " Out",
			"audioOut2": "Out",
			"author": "Mitch Lantz"
		},
		{
			"num": "30",
			"name": "1vot 3synths",
			"type": "Sound Source",
			"shortDesc": "Voltage dependant multi-synth",
			"longDesc": "A multi-synth patch that triggers a different sound depending on value sent into the pitch in jack or the keyboard.",
			"controls": "Synth 2 & 3 thresholds set the note that will trigger a new oscillator.  For example If synth 2 threshold is set to \"G2\" and synth 3 is set to \"G4\" then anything below G2 will trigger synth 1, in value between G2 and G4 will trigger Synth 2 and values of G4 and above will trigger synth 3",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "0-10v: pitch input, will trigger a different sound depending on the note",
			"cvIn2": "0-10v: trig in",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": " Out",
			"audioOut2": "Out",
			"author": "Mitch Lantz"
		},
		{
			"num": "31",
			"name": "Feedbacker",
			"type": "Sound source/effect",
			"shortDesc": "self-oscillating feedback reverb",
			"longDesc": "Inspired by the unobtainium Tllde Elektrisk Kretser Fjaerlett, this patch places a parametric EQ in the feedback path of a plate reverb.  A compressor, acting as a limiter, governs the feedback path.  The individual EQ filters (bell filters in series) can be tuned and their levels cut or boosted by 40 dB.  In addition, a ring modulator was added to the feedback path, allowing you to create even more twisted feedback paths.\n\nAudio can be fed into the patch, but it was designed with self-oscillation in mind.",
			"controls": "Each EQ has an individual frequency and gain control.  Additionally, below each frequency and gain control is a momentary button which will increase that filter's gain to maximum, allowing you to \"play\" the filters.\nThere is a UI button (also mirrored in the user buttons) which allows you to change the Q of the filters.\n\nAlso in the feedback loop are an aliaser, a low-pass filter and a high-pass filter for further shaping the harmonic content of the feedback.\n\nReverb decay should be familiar.  \"Comp threshold\" defines the threshold of the compressor and in many ways acts as an overall level control for the patch.  \"Feedback level\" controls how much of the reverb's signal is fed back into the EQ.  There is also a level control for the dry signal.\n\nThe ring mod frequency and mix allow you to determine the frequency of the ring mod oscillator and how much of the feedback passes through it.",
			"btn1": "Reverb freeze (momentary, also cuts signal to feedback path, holding the last sound generated as frozen)",
			"btn2": "Filter Q (momentary, redundant with control page UI button)",
			"cvIn1": "0-5V:  Feedback level (with attenuverter)",
			"cvIn2": "0-5V:  Reverb decay (with attenuverter)",
			"cvIn3": "0-10V:  Ring mod frequency (with attenuverter; operates at V/oct when set to 1.000).",
			"cvIn4": "0-5V:  Ring mod mix (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "",
			"audioIn1": "",
			"audioIn2": "",
			"audioOut1": "",
			"audioOut2": "",
			"author": "Christopher Jacques"
		},
		{
			"num": "32",
			"name": "Green bank",
			"type": "Effect",
			"shortDesc": "configurable filter bank",
			"longDesc": "A simple, 12-bandpass filter bank.  By default tuned to the same frequencies as the Moog filter bank.\n\nThere is the option to add white noise to the circuit, which when the resonance is set high, allows for spectral synthesis.",
			"controls": "Most of the controls should be familiar.  There is a filter frequency and amplitude control for each filter.\n\nThe resonance control is gain-compensated to a degree, to try to keep gain in check as resonance is increased.",
			"btn1": "No assignment",
			"btn2": "N/a",
			"cvIn1": "0-10V:  Frequency modulation for all filters (with attenuverter; at 1.000 tracks 1 V/oct)",
			"cvIn2": "N/a",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "33",
			"name": "Convolving",
			"type": "Effect",
			"shortDesc": "granular convolved reverb",
			"longDesc": "Convolution is simply the process of multiplying two sounds together.  The most common application is a spectral multiplication of a sound with a sampled space, producing convolution reverb.\n\nThis patch takes a different, altogether... grainier... approach, convolving a reverb by a granular version of itself.  Like a ghost controlling a radio tuner.",
			"controls": "The controls are all familiar, if you have experience with granular modules (most of the controls) or reverb (decay).  The exception is \"Smoothness,\" which determines how much of the granulated signal passes through the reverb first.",
			"btn1": "Reverb freeze (momentary)",
			"btn2": "Granular freeze (latching)",
			"cvIn1": "0-5V:  Wet level (attenuverter available)",
			"cvIn2": "0-5V:  Position (attenuverter available)",
			"cvIn3": "0-5V:  Grain size (attenuverter available)",
			"cvIn4": "0-5V:  Pitch (attenuverter available)",
			"cvOut1": "0-5V:  Slow sine LFO",
			"cvOut2": "0-5V:  Slow sine LFO",
			"cvOut3": "0-5V:  Slow sine LFO",
			"cvOut4": "0-5V:  Slow sine LFO",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "34",
			"name": "XYZebu",
			"type": "Effect",
			"shortDesc": "X/Y controlled granular delay",
			"longDesc": "Really an exercise in the flexibility of ZOIA's UI, this patch makes use of an X/Y grid to control a granular delay.  You can leaf through different \"pages,\" which will change the colors of the X/Y grid and recall the saved positions of those pages.\n\nI thought it might be a nice template for other X/Y axis applications (the pages containing the outputs of each axis -- sample and hold modules -- are labeled, so it should be fairly easy to tear out the current audio processing and replace it with something else).",
			"controls": "The left user button is used to \"page\" through the X/Y grids (you don't have to change pages in the patch; instead the UI buttons on the first page will change color to reflect the current \"page\" of X/Y controls).\n\nPage 1 (red) -- delay time/feedback\nPage 2 (yellow) -- granular pitch/mix\nPage 3 (aqua) -- grain size/grain density\nPage 4 (blue)-- position randomizing speed/texture\nPage 5 (lime) -- CV outs (out 1 and 2)",
			"btn1": "Next page (changes the presentation of the UI buttons and what they are used to control)",
			"btn2": "Granular freeze (latching)",
			"cvIn1": "N/a",
			"cvIn2": "N/a",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "0-5V:  CV out 1 (controlled on page 5; X axis)",
			"cvOut2": "0-5V:  CV out 2 (controlled on page 5; Y axis)",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "35",
			"name": "Parts V2",
			"type": "Effect",
			"shortDesc": "macro micro-looper/ambient machine",
			"longDesc": "Randomly triggered loopers produce swirls of accompaniment:  each can be repitched, reversed, and will be randomly panned.  These are fed into a reverb lite to produce \"space.\"\n\nThe \"loop\" designation refers to a delay line-based loop (held buffer) which remains silent while recording the outputs of the loopers.  You can then replace and add to the loop to create an intricate bed beneath the effect.\n\nPorted from ZOIA, extensive patch notes can be found at:  https://patchstorage.com/parts-a-macro-micro-looper/",
			"controls": "Along the left side are pitch and reverse controls for the loopers.\n\n\"Density\" determines how likely it is that the loops record.\n\n\"Reverb\" is a macro that controls both the decay and mix of the reverb lite.\n\nThere are various mix controls:  loop level (this controls the volume of the held buffer looper that listens to the output of the random loopers), wet level, and dry level.\n\nA clock divider in the middle of the page determines the length of the held buffer.  There is also an \"Add\" button to add to this loop once it has been recorded.",
			"btn1": "Tap tempo (will be overriden by clock)",
			"btn2": "Loop output (this is designed with a flexi-switch approach:  a short tap will turn the loop off and on; a long press will turn the loop off or on for the duration of the press; when the loop is off it is also recording over what had been previously recorded into the buffer, so this can be used to replace and splice together different sounds)",
			"cvIn1": "0-10V:  Clock in",
			"cvIn2": "0-10V:  Loop output (see user button 2 comments)",
			"cvIn3": "0-10V:  Add (overdubs onto the output loop)",
			"cvIn4": "0-5V:  Density (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "36",
			"name": "Meter Made",
			"type": "Effect",
			"shortDesc": "stereo distortion/parallel compressor/EQ with dual-band VU metering",
			"longDesc": "Based on a channel strip, this patch offers drive from subtle warming to distortion (via a 'pushed' model overdrive), parallel compression, and EQing (in that order) to help you glue a track/mix together.  Used subtly, it can bring out the qualities of your sound you want to accent; used less-than-subtly, it can destroy/transform those sounds.\n\nOn either side are VU meters for that channel (post effects), with a low-high level defined by the midrange frequency of the EQ.",
			"controls": "The controls follow the signal path, beginning with gain for the overdrive, then the compressor controls (threshold, attack, release, ratio, blend).  There is a makeup gain stage added, which you can also use to boost the signal.  Finally, the EQ, which is comprised of a low-shelf, midrange (peak/notch), and high-shelf.",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "0-5V:  Gain (with attuverter); controls the overdrive gain",
			"cvIn2": "0-5V:  Threshold (with attenuverter)",
			"cvIn3": "0-5V:  Ratio (with attenuverter)",
			"cvIn4": "0-5V:  Compression blend (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "37",
			"name": "1978 Plate V2",
			"type": "Effect",
			"shortDesc": "PCM-style plate reverb",
			"longDesc": "Inspired by the Dattoro loop reverb, 1978 Plate aims to capture some of the ambience of a algorithmic plate reverb, creating lush spaces.\n\nPorted from ZOIA, extensive patch notes can be found at:  https://patchstorage.com/1978-plate-a-b-two-takes-on-a-famous-reverb-sound/",
			"controls": "High and low damping controls the tone of the reverb.  Input gain can be used to push the diffusers into distortion (this can be compensate with the wet level control as it can add up to 18 dB of gain).\n\nPre-delay allows you to add pre-delay to the reverb.  It can also be fed back onto itself, producing everything from comb filtering resonances to delay/reverb combinations that produce washes of sound.  Feedback can be turned off and on with the button on the right side.\n\nDecay controls the length of the reverb; diffusion controls the echo density.\n\nMod rate and depth control the modulation of the reverb tails.\n\nWet level and dry level are probably pretty self-explanatory.",
			"btn1": "Maxes reverb decay (momentary)",
			"btn2": "Maxes delay feedback (momentary, can be used even when the delay feedback is turned off)",
			"cvIn1": "0-5V:  Decay (with attenuverter)",
			"cvIn2": "0-5V:  Pre-delay time (with attenuverter)",
			"cvIn3": "0-5V:  Wet level (with attenuverter)",
			"cvIn4": "0-5V:  Dry level (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "38",
			"name": "X-over",
			"type": "Effect",
			"shortDesc": "dual-band stereo delay",
			"longDesc": "Filters separate the incoming signal into high and low bands, each with their own delay.  The low band delay is an old tape stereo ping-ping delay, while the high band delay is a stereo tape delay.\n\nEach delay has its own clock divider, so the two bands can be rhythmically correlated.\n\nThey also have individual crossovers, which spill the output of one band's delay into the other, while raising its feedback, resulting in oscillations and waves of repeats.",
			"controls": "Each delay has its own feedback control and level.  Each delay also has something called xover time, which determines how quickly it spills into the other delay.\n\nIn the center are controls for the cross-over frequency that separates the bands and the dry level.\n\nAbove the clock input is a pushbutton called Tap Tempo that can be used if a clock is not present.\n\nThe dividers for the two delays are located on the second page and labeled.",
			"btn1": "High xover -- spills the high delay into the low delay",
			"btn2": "Low xover -- spills the low delay into the high delay",
			"cvIn1": "0-10V:  Clock",
			"cvIn2": "0-5V:  High time (with attenuverter -- can be used to add modulation or more wild pitch/time changes)",
			"cvIn3": "0-5V:  Low time (with attenuverter)",
			"cvIn4": "0-5V:  Crossover frequency (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "39",
			"name": "Fragments",
			"type": "Effect",
			"shortDesc": "Granular delay, looper, modulation",
			"longDesc": "Granular delay and pitch shifter with feedback and clocked reverse looping.",
			"controls": "All granular controls exposed on front panel (density, position, size, position, pitch), plus extras to extend into a delay with feedback, lpf, random LFO speed/depth, vibrato amount, and tap tempo. Includes clock and freeze display, as well as \"gran\" and \"loop\" indicators for determining the routing (loop = reverse looper, gran = granular engine).",
			"btn1": "Freeze: toggles granular freeze (flexi)",
			"btn2": "Rev: toggles whether audio goes through the looper or granular buffers (momentary)",
			"cvIn1": "0-10V: granular size/looper length",
			"cvIn2": "0-10V: granular/looper pitch",
			"cvIn3": "0-10V: granular/looper texture",
			"cvIn4": "0-10V: Clock, includes 2/8 clock filter",
			"cvOut1": "0-10V: Random LFO",
			"cvOut2": "0-5V: Slewed random LFO",
			"cvOut3": "0-10V: Looper cycle gate",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Mike Moger"
		},
		{
			"num": "40",
			"name": "3011",
			"type": "Effect",
			"shortDesc": "Resonant comb filter, bbd reverb, multitap delay",
			"longDesc": "Cascading delay lines to mimic an early form of reverberation, with input/output filters and triangle-exponential modulation. Adapted from https://patchstorage.com/schroeder-reverberators-three-takes-on-a-classic-reverb-design/",
			"controls": "Space (delay bias), mix, feedback, lfo rate, lfo depth, input lpf, output hpf, and attenuators for delay, feedback. and ext mod inputs.",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "0-10V: Delay modulation (+ atten)",
			"cvIn2": "0-10V: Feedback (+ atten)",
			"cvIn3": "0-10V: External modulation (+ atten)",
			"cvIn4": "N/a",
			"cvOut1": "0-5V: Combined triangle-random lfo",
			"cvOut2": "0-10V: Triangle lfo",
			"cvOut3": "0-5V: Random lfo",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Mike Moger"
		},
		{
			"num": "41",
			"name": "Spin Cycle",
			"type": "Effect",
			"shortDesc": "Granular looper, time-stretch, aliaser",
			"longDesc": "Dual grain/glitch looper with feedback, time-scanning, and aliased delay lines.",
			"controls": "Mix, delay time, alias frequency, delay feedback, bell cutoff, loop length, reverb time, loop speed and atten.",
			"btn1": "Tap tempo: Looper cycle",
			"btn2": "N/a",
			"cvIn1": "0-10V: Speed (+ atten)",
			"cvIn2": "0-10V: Scan",
			"cvIn3": "0-10V: Clock, includes 2/8 clock filter",
			"cvIn4": "N/a",
			"cvOut1": "0-10V: Random LFO",
			"cvOut2": "0-10V: Env follower",
			"cvOut3": "0-5V: Inverted env follower",
			"cvOut4": "0-10V: Looper cycle",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Mike Moger"
		},
		{
			"num": "42",
			"name": "Synced loopers",
			"type": "Effect",
			"shortDesc": "dual stereo clock-synced loopers",
			"longDesc": "Designed to avoid clock drift, the synced loopers reset in time with incoming clock.  The UI allows for a number of configurations, including preset loop lengths, reverse, and different speed/pitch options, all designed to stay in time with the master clock.",
			"controls": "There are two control pages.\n\nOn the first, you will find two rows of sixteen blocks.  These show your loop as it records and as it plays back (note:  when playing in reverse, the loop position indication will still move forward).\n\nWhen the patch first loads, you may see the cursor clicking across the page, but it will reset in accordance with the loops once recording begins.\n\nYou can loop in two ways:  you can use a latching input to record as long as the latch is maintained (up to 16 beats), or you can set a beat limit for each loop by pressing any of the loop beat count indicators in those row.  (The patch is loaded with 16 beats set; if you find the loops cutting off unexpectedly during recording, press the 16th beat count and save the patch for future use.)  The second method is very interesting when both loops are recorded at the same time but with different beat counts, for Steve Reich-esque experiments in syncopation.\n\nAcross the bottom of the page are controls to overdub, reset, a tap tempo (overriden by incoming clock), and level controls for loop A, loop B, and the dry level.\n\nOverdubbing is a bit odd; it will cut off when the loop resets.  Also, loops will always be recorded moving forward at the speed of original loop.  If the loop is, for instance, pitched down and reversed, if you should return the loop to its original speed and direction, an overdub recorded onto the loop would become sped up and reversed.  It takes a little time to get used to, but it can be used to create some very interesting textures as different speeds and directions pile up on one loop.\n\nOn the second page, you will find controls to set the pitch-speed (-octave, -fifth, \"as recorded\" or the speed of the original looped material, fifth, octave) and direction of each loop.",
			"btn1": "Loop A record (this is a latching switch; to end recording, the button must be pressed again)\n\nRecording will not begin until the next clock is received.",
			"btn2": "Loop B record (this is a latching switch; to end the recording, the button must be pressed again)",
			"cvIn1": "0-10V:  Clock\n\nA steady clock is advised for best 'normal behavior' as the loops have no way to speed up or slow down to compensate for changes in the clock.  However, if the clock speed is increased, the loops will be cut off and if the clock speed is decreased, silences will follow the loops before they begin playing back again.  There are probably interesting ways to exploit this behavior (especially a faster clock speed; for instance, a clock speed twice as fast would result in a loop half as long.  Something to think about).",
			"cvIn2": "0-10V:  Loop A record (use a trigger or short gate to latch and begin recording, and another trigger or short gate to end recording)",
			"cvIn3": "0-10V:  Loop B record (use a trigger or short gate to latch and begin recording and another trigger or short gate to end recording)",
			"cvIn4": "N/a",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "43",
			"name": "LoopSampler",
			"type": "Effect",
			"shortDesc": "polyphonic loop player",
			"longDesc": "LoopSampler records one-shot loops, which can be treated much like samples.  You can play these loops back \"polyphonically\" via overlapping playback, and the loops can either be triggered, causing them to run to the end of the loop buffer, or gated, which will cause them to playback until the gate is released.  Recording can be freeform or clocked.\n\nEach loop has its own set of controls -- pitch, reverse, start, end -- to allow you to fine-tune it.  There is also a basic effects section (stereo spread, reverb lite) to give more personality to your loops.\n\nThere are also a few random tools that can be used for self-patching or elsewhere in your rack.",
			"controls": "To record loops, either press the record button or send a gate to the record input.  You can clock this recording, as well, by sending a clock to the clock input and selecting \"Clocked record\" on the second page.  When using clocked record, the loops will begin to record on the next clock signal after the record button or record gate go high.\n\nWhen you load the patch, the top row will be red.  This means the buffers are available to record in.  As you record, the row will switch to yellow.  When you playback, the individual loops will be green (although with a triggered input, this may not be evident).\n\nYou can use the top row of buttons to playback loops, as well as CV.\n\nThe rest of the controls on the first page can be used to fine-tune the loops, changing their direction or trimming their length, etc.\n\nOn the second page are a few tools related to the loopers:  \"reset\" allows you to return to the start of the recording sequence.  \"Clocked record\" allows you to use clock for recording the loops.  \"Gate or trigger\" will determine whether the loops are gated (will playback only as long as a button is pushed or a gate received at the playback input) or triggered (the loops will play to the end of their buffer once triggered).  \"Advance\" can be used to advance the sequencer to re-record a buffer (you can begin advancing through the sequencer by resetting it; as long as no record command is received, buffers will remain intact).\n\nThere are controls for the effects section and overall level on this page as well.\n\nAt the bottom of the page is a tap tempo for the clocked random tools (overriden by a clock input) and a \"Gate chance\" to determine how often a random gate is produced.",
			"btn1": "Record (latching)",
			"btn2": "Reset (momentary; resets the sequencer that controls the recording mechanism; does not reset the loops themselves)",
			"cvIn1": "0-10V:  Record gate",
			"cvIn2": "0-10V:  Playback (can receive gates or triggers)",
			"cvIn3": "0-5V:  Loop select (this is automatically attenuated by the progress of the sequencer)",
			"cvIn4": "0-10V:  Clock in",
			"cvOut1": "0-5V:  Random voltage out",
			"cvOut2": "0-10V:  Random gate clocked out (this will output will produce a gate every clock cycle depending on the \"gate chance\" control)",
			"cvOut3": "0-10V:  Clock out",
			"cvOut4": "0-10V:  Random gate out (this gate can exceed the length of a clock cycle; its likelihood and average length are determined by the \"gate chance\" control)",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		},
		{
			"num": "44",
			"name": "Loop seq",
			"type": "Effect",
			"shortDesc": "a stereo loop sequencer",
			"longDesc": "Loop seq allows you to sequence the playback of a loop in up to eight steps.  Each step can be set to a different speed/pitch (or randomly assigned a speed/pitch from a defined range, quantized or unquantized), can play forward or reverse, and has an individual volume control.  The controls allow you to make everything from house-of-mirrors wackiness to repeating, rhythmic and melodic sequences.",
			"controls": "On the first page are four rows that control the loop per step.\n\nAcross the top row is a visual display of what step is being played, but pressing the UI buttons used for that display will override the row below (speed-pitch) and set the loop to change randomly each time the sequence cycles.\n\nSpeed-pitch allows you to set the speed of each step.  This will also affect the speed of the overall sequence, as low/slower steps take longer to play and high/faster steps take less time to play.\n\nReverse allows you to reverse a given step.\n\nLevel allows you to set the volume for each step including muting steps (0).\n\nIn the bottom right corner are controls for determining the slew rate between steps (applies to both speed-pitch and volume) as well as the parameters for the random steps, with a low and high value, as well as an option to have the random selections quantized or not.  The quantizer on the next page selects how the steps are quantized (please note:  it is set to the key of A because 'A' here is a neutral position relative to the default loop speed; it will not quantize to absolute pitch).\n\nThe sequencer on the next page can also be used to shorten the loop.  Select the second track (a gate track) and place a gate on that track to change where the loop resets.",
			"btn1": "Record (latching)",
			"btn2": "Reset (momentary); this will cause the sequence to reset on the step",
			"cvIn1": "0-10V:  Record (there is a pushbutton above this input on the first page that allows you to switch between gate recording -- the patch will record as long as the gate is high -- and trigger recording -- the patch will begin recording on the receipt of a trigger and end recording on the receipt of a subsequent trigger)",
			"cvIn2": "0-10V:  Reset",
			"cvIn3": "-5-5V:  Speed-pitch (with attenuator); this allows you to modulate the speed/pitch of the loops",
			"cvIn4": "N/a",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "45",
			"name": "Sliced Pice",
			"type": "Effect",
			"shortDesc": "clocked slicer/re-sequencer/beat repeat effect",
			"longDesc": "Sliced pie lets you loop incoming signal and remix it on the fly, choosing from one of eight memory slots in whatever order you want.  Everything from beat repeating to shuffled melodies to glitchy granular effects are possible.\n\nTo add to the fun, an aliaser and envelope swept 12dB/octave low-pass filter have been added to the repeater for grungy, swept remixing.",
			"controls": "Across the top are controls for the aliaser and filter.  The filter has a start and end frequency; if you set the start higher than the end, the envelope will sweep down, and vice versa.  There are envelope controls -- attack, decay, sustain (no release, because when the envelope is released, so is the repeated slice).  There is also a retrigger switch that causes the envelope to retrigger when you change slices.\n\nThere's a light show, showing a recording passing through the buffers; it is useful because once you release a slice, the lights all need to cycle for the buffers to be replenished.\n\nThere's a slice select row below that; the left-hand slices are more recent, the right-hand slices are older.\n\nBelow that is a clock multiplier/divier (1/4, 1/2, 1, 2x., 4x, 8x, 16x).  Finally, there is a \"tempo lock\" which will delay the slice until the next clock signal is received.",
			"btn1": "Tap tempo (overriden by clock in)",
			"btn2": "Random slice (latching; will lock the slicer and choose slices randomly in time with the clock)",
			"cvIn1": "0-10V:  Clock in",
			"cvIn2": "0-10V:  Lock (locks the slices in place and enters slicer mode)",
			"cvIn3": "0-5V:  Slice select",
			"cvIn4": "N/a",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In (wet sums to mono)",
			"audioIn2": "In (wet sums to mono)",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "46",
			"name": "Playing Tag",
			"type": "Effect",
			"shortDesc": "glitchy, pitch-analysis driven looper",
			"longDesc": "A pair of loopers continuously record and playback.  The audio input is analyzed, and the output of the looper is compared with this; the difference is added to the looper.  In theory, the audio input and the looper should harmonize, but because changing the speed of the looper to match the input changes the output that is analyzed, the two never quite match up, creating pitch dives, stutters, and other bizarre behavior.",
			"controls": "The most important control is called \"filtering.\"  This is not audio filtering, but instead CV filtering that is applied to the pitch compensation sent to the loopers.  Smaller amounts of filtering will result in more dramatic, glitchy effects; greater amounts will cause the looper to slowly fluctuate in speed, warbling and dipping.\n\nA speed offset can be added to the looper, making the pitch detector's job even harder.\n\nFinally, the volume of the loopers' output can be used duck the dry input.  The degree to which this happens depends on the \"Dry Suppress\" control.",
			"btn1": "Tap tempo (will be overriden by clock)",
			"btn2": "Reverse (reverses the loopers)",
			"cvIn1": "0-10V:  Clock",
			"cvIn2": "0-10V:  Reverse (triggered latching)",
			"cvIn3": "-5-5V:  Filtering (with attenuverter)",
			"cvIn4": "-5-5V: Loop speed (with attenuverter)",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "47",
			"name": "Arithmetic",
			"type": "CV mixer, envelopes. Effect",
			"shortDesc": "ring mod, bit modulator.",
			"longDesc": "4-channel CV and audio utlity. Features two CV variable inputs and 2 audio inputs for all your mixing, summing, attenuverting, slewing, and ring mod needs.",
			"controls": "Cycle buttons for ADSR-looping, rise/fall/shape for both channels, attenuverters for each channel. Channels 2 and 3 are normalled to +/-10 and +/-5V respectively when nothing is patched to the audio inputs. Toggles to remove each channel from the mixer. Indicator for mixer status.",
			"btn1": "Mix toggle: toggles mixer CV output (latch)",
			"btn2": "Gate toggle: toggles gate CV output (latch)",
			"cvIn1": "0-10V: Channel 1 input, includes 5/5 clock filter",
			"cvIn2": "0-10V: Channel 4 input, includes 5/5 clock filter",
			"cvIn3": "0-10V: Both (inverse modulation on rise & fall)",
			"cvIn4": "0-10V: Shape (for both inputs)",
			"cvOut1": "0-5V: Func 1",
			"cvOut2": "0-5V: Func 2",
			"cvOut3": "0-5V: Mixer (sum, inv, average)",
			"cvOut4": "0-10V: Gate (EOR/EOC)",
			"midi": "N/a",
			"audioIn1": "Channel 2 in",
			"audioIn2": "Channel 3 in",
			"audioOut1": "Ring mod out",
			"audioOut2": "Ring mod out",
			"author": "Mike Moger"
		},
		{
			"num": "48",
			"name": "Quad Flex",
			"type": "Utility",
			"shortDesc": "quad LFO with interesting self-patching options",
			"longDesc": "Quad flex offers a comprehensive and flexible four-output LFO.\n\nEach LFO can be configured to run on clock or free-running; to accept phase reset commands (or ignore them); have its rate modulated by an external source (or internal one, hence that self-patching note); or to be tracked and held when an external source goes high (or an internal one -- this one allows for some really intriguing LFO shapes).\n\nEach LFO also has independent clock dividers (on the second page), rate controls, swing controls (these distort the waveform; for the square wave, they change the duty cycle), phase control, shape selection and the option to be used as a bipolar or unipolar LFO.\n\nThere are also two special modes:  Sync watches synchronizes all of the LFO's to LFO 1's clock or rate control.  Quad mode likewise synchronizes to LFO 1's clock or ate, but also disables the phase control and sets the LFOs in quadrature mode.\n\n",
			"controls": "Most of the controls were described in the patch description....\n\nI'll go into a little more detail about some of the buttons.\n\nAlong the left-most column are \"Free\" buttons which allow you to select whether the LFO responds to a clock (clock dividers for each LFO are found on the second page and labeled). or to the rate controls across the top right side.\n\nThere are a row of rate modulation attenuverters; rate modulation can be applied in either clocked or free mode.\n\nThe phase reset buttons determine whether that LFO will respond to phase reset messages received at the input below.\n\nThe track and hold buttons determine whether that LFO will held when the input below goes high.\n\nThe shape button allows you to select between different waveforms for each output (the button will change color and modulate in the fashion of the selected waveform):  orange = square, yellow = sine, green = triangle, aqua = ramp, blue = sawtooth, magenta = random.\n\nWhen the bipolar-unipolar button is low, the output is bipolar (-5 to 5V); when high, it is unipolar (0 to 5V).",
			"btn1": "Tap tempo (will be overriden by clock)",
			"btn2": "Phase reset (applied to all LFOs regardless of phase reset option selected)",
			"cvIn1": "0-10V:  Clock in",
			"cvIn2": "-5-5V:  Rate mod input (with individual attenuverters for each LFO)",
			"cvIn3": "0-10V:  Phase reset input (individually enabled for each LFO)",
			"cvIn4": "0-10V:  Track and hold input (individually enabled for each LFO)",
			"cvOut1": "-5-5V:  LFO 1 out",
			"cvOut2": "-5-5V:  LFO 2 out",
			"cvOut3": "-5-5V:  LFO 3 out",
			"cvOut4": "-5-5V:  LFO 4 out",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		},
		{
			"num": "49",
			"name": "Not My Tempo",
			"type": "Utility",
			"shortDesc": "Variable clock source. Effect: Tremolo.",
			"longDesc": "4-channel LFO and clocking system, average LFO determines tremolo depth.",
			"controls": "Each LFO has the following controls: mute, shift, clock mult, clock division, shape (square/triangle/sine), and phase. Globally there is an input clock or tap-tempo for the master, a CV input (with atten) for modulation, and phase reset. Tremolo depth amount from LFOs.",
			"btn1": "Reset: phase reset for driving clock (momentary)",
			"btn2": "Shift: flips mult and div settings (momentary)",
			"cvIn1": "0-10V: Clock source, includes 2/8 clock filter",
			"cvIn2": "0-10V: Shift gate, includes 2/8 clock filter",
			"cvIn3": "0-10V: CV for tempo modulation",
			"cvIn4": "N/a",
			"cvOut1": "0-10V: LFO 1",
			"cvOut2": "0-10V: LFO 2",
			"cvOut3": "0-10V: LFO 3",
			"cvOut4": "0-10V: LFO 4",
			"midi": "N/a",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Mike Moger"
		},
		{
			"num": "50",
			"name": "Professor Chaos",
			"type": "Utility",
			"shortDesc": "Chaotic LFO source. Effect: Granular delay, freeze. ",
			"longDesc": "Mathematical representation of 4 chaotic attractors + granular delay. Adapted from https://patchstorage.com/chaotic-attractor-pack-faithful-recreations-of-3-dynamical-systems-to-use-as-lfos-sound-generators-or-as-is/",
			"controls": "Adjustable free-parameters for chaotic systems (note that not every system uses each of these). Wet and dry controls for levels. Chaos depth and speed for LFO outputs. Clock rate display, freeze toggle display. Tap tempo pushbutton. Patch includes smart clocking system which combines MIDI clock, CV clock, rate control, and tap tempo input. Continuous clocks are favored but tap and rate controls can override these. See the clock page for this logic.",
			"btn1": "Freeze: toggles granular freeze (flexi)",
			"btn2": "System: select chaotic source (latch)",
			"cvIn1": "0-10V: Param 1",
			"cvIn2": "0-10V: Param 2",
			"cvIn3": "0-10V: Param 3",
			"cvIn4": "0-10V: Clock, includes 2/8 clock filter",
			"cvOut1": "0-10V: LFO X",
			"cvOut2": "0-10V: LFO Y",
			"cvOut3": "0-10V: LFO Z",
			"cvOut4": "0-10V: LFO sum",
			"midi": "Clock",
			"audioIn1": "In",
			"audioIn2": "In",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Mike Moger"
		},
		{
			"num": "51",
			"name": "PolyRhythmiZOIA",
			"type": "Utility",
			"shortDesc": "polyryhythmic gate sequencer",
			"longDesc": "Inspired by the polyrhythmic nature of the Subharmonicon, PolyRhythmiZOIA produces three tracks of polyrhythmic, polymetric gates that combine different clock divisions.",
			"controls": "There are three rows across the top.  Pressing one of the UI buttons on a given row will place a gate.  Pressing and holding the button until the color changes will set the end point of the sequence (up to eight steps per track).  A white light shows the progress of each track.\n\nThe white blocks allow you to set clock divisions, with lower numbers representing smaller divisions (beginning at 1/1) and higher values representing larger divisions (up to 1/16).  Then, the pushbuttons corresponding to each track's color let you assign dividers to that track.\n\nA clock divider on the second page can be used to further divide or multiply the incoming clock (it helps to have a fast clock as the base tempo, since it will be divided).",
			"btn1": "Tap tempo (will be overriden by clock)",
			"btn2": "Reset (resets all sequences and dividers)",
			"cvIn1": "0-10V:  Clock",
			"cvIn2": "0-10V:  Reset",
			"cvIn3": "0-10V:  Pause (there is a mechanism to make sure the patch does not load in a paused state; if you would like to change that, delete the trigger on the page maked \"pause\")",
			"cvIn4": "N/a",
			"cvOut1": "0-10V:  Track 1 out",
			"cvOut2": "0-10V:  Track 2 out",
			"cvOut3": "0-10V: Track 3 out",
			"cvOut4": "0-10V:  Nor out",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		},
		{
			"num": "52",
			"name": "Hide and Seq",
			"type": "Utility",
			"shortDesc": "a playful, clock-agnostic sequencer",
			"longDesc": "Loosely inspired by some concepts from the 0-ctrl sequencer, Hide and Seq is a bouncy, playful sequencer.  Each step length can be set to a percentage of a defined length, and it can switch directions at the turn of a hat.  There is an additional voltage sequencer, and the note and voltage outputs have individual portamento amounts.\n\nThere is a basic synth voice included to demonstrate the patch (the voltage is routed to the filter frequency and resonance).",
			"controls": "A master length parameter sets the maximum possible step length (up to 60 seconds).  The individual step lengths are percentages of this, so, if the master length is 1 second, a step length of .5 would be 500 milliseconds, .25 would be 250 milliseconds, etc.\n\nThe patch can also be combined with an external clock, which doesn't always work as expected (sometimes skipping steps, sometimes repeating them).\n\nThere are rows for notes and voltage, with portamento controls for both outputs.\n\nThere is also a UI button to change the direction of the sequence.",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "0-10V:  Clock",
			"cvIn2": "0-10V:  Direction (a trigger or gate will change the direction)",
			"cvIn3": "0-5V:  Gate length (with attenuverter)",
			"cvIn4": "N/a",
			"cvOut1": "0-10V:  Note out",
			"cvOut2": "0-10V:  Gate out",
			"cvOut3": "-5-5V:  Voltage out",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		},
		{
			"num": "53",
			"name": "Turing's Dream",
			"type": "Utility",
			"shortDesc": "random CV generator/looper",
			"longDesc": "Based on an analog shift register, Turing's dream generates CV and gates random, with varying degrees of stability, creating pockets of repetition and looping while evolving over time.",
			"controls": "The top two rows display the CV buffer.  Pressing any of the UI buttons used will set the length of the CV buffer from 1 to 16 steps.  Step 1 is the current out, while everything after it displays the current memory of the patch.\n\nThe \"Stability\" control determines per step whether the buffer samples a new, random value, or cycles through its memory buffer.  The low and high values allow you to determine the range of random voltage produced.\n\nAlong with a traditional voltage-based Turing machine, the patch produces a gate buffer as well, which can be adjusted with the \"Gate buffer length\" control to be any from 1 to 16 steps as well (there are presets for 4, 8, and 16 steps, with an option for a custom buffer length, too).  It also has a \"Gate stability\" control, which determines whether the buffer samples from a new, probabilistic gate outcome (as determined by the \"Gate chance\" control) or cycles through its memory buffer.  \n\nThe gate buffer can be a different number of steps than the CV buffer, which opens up a lot of opportunity for their interplay.\n\nTuring's Dream also produces a second output, randomly sampled from the buffer.  You can set its sample rate.  The outputs can be quantized (quantizers on the second page).",
			"btn1": "Loop CV buffer",
			"btn2": "Loop gate buffer",
			"cvIn1": "0-10 V:  Clock in (there is also a tap tempo control)",
			"cvIn2": "0-5 V: CV stability (this control has an attenuverter and interacts with the CV stability control)",
			"cvIn3": "0-5 V:  Gate stability (this control has an attenuverter and interacts with the gate stability control)",
			"cvIn4": "N/a",
			"cvOut1": "0-10V:  CV buffer out",
			"cvOut2": "0-10V:  Gate buffer out",
			"cvOut3": "0-10V:  Sampled CV out",
			"cvOut4": "0-10V:  NOT gate (goes high when the gate buffer output goes low)",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		},
		{
			"num": "54",
			"name": "Random progress",
			"type": "Utility",
			"shortDesc": "Sequencer with probability options",
			"longDesc": "This is a version of the very first patch I made with Zebu.\n\nThe basic premise is an 8-step sequencer, which can have a probility to advance to a new step, reset, or produce a ratchet.  You can also set steps to generate random note values, with definable low and high notes, and a quantizer to change the key/scale of those notes to fit your sequence.\n\nThe output of the sequencer is also randomly sampled, and each time it is sampled, a gate is produced.\n\nTo demonstrate the principles, I included a two-voice synth (they share the same architecture for simplicity).  One voice is controlled by the main sequence, and the other by the samples drawn from that sequence.",
			"controls": "The top row shows the progress of the sequence.  Pressing one of the grid blocks on this row will also change the length of the sequence.\n\nThe second row is used to set notes.  Values of A0 will produce random notes, defined by the quantizer controls:  low and high note set a range, while the UI buttons move through keys and scales (I wish I had a better way to display this; the UI buttons will change color each time a new key and scale are selected, but it is probably best to count, with the knowledge that red = A).\n\nBelow this row are controls for the probabilistic elements of the patch:\nStep chance will allow you to determine if the sequencer advances on the next clock cycle.  (Higher values mean it is more likely to occur.)\nReset chance is the likelihood that the sequencer will reset to step 1.\nRatch chance is the likelihood that the sequencer will produce a ratcheted outcome.  There is also a range for the ratcheting (as they can get very fast very quickly).\n\nBelow is the sample rate for the sampled note; it determines the likelihood that a new note will be sampled on a given step.  The sample offset is used to transpose the sampled note.\n\nThe rest of the controls govern the internal voice.",
			"btn1": "Tap tempo (will be overriden by clock)",
			"btn2": "Mutes Voices",
			"cvIn1": "0-10V:  Clock in",
			"cvIn2": "0-5V:  Step chance (with attenuverter)",
			"cvIn3": "0-5V:  Reset chance (with attenuverter)",
			"cvIn4": "0-5V:  Ratchet chance (with attenuverter)",
			"cvOut1": "0-10V:  Sequencer note output",
			"cvOut2": "0-10V:  Sequencer gate output",
			"cvOut3": "0-10V:  Sampled note output",
			"cvOut4": "0-10V:  Sampled gate output",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "Out",
			"audioOut2": "Out",
			"author": "Christopher Jacques"
		},
		{
			"num": "55",
			"name": "ProbableOutcome",
			"type": "Utility",
			"shortDesc": "quad LFO with interesting self-patching options",
			"longDesc": "Quad flex offers a comprehensive and flexible four-output LFO.\n\nEach LFO can be configured to run on clock or free-running; to accept phase reset commands (or ignore them); have its rate modulated by an external source (or internal one, hence that self-patching note); or to be tracked and held when an external source goes high (or an internal one -- this one allows for some really intriguing LFO shapes).\n\nEach LFO also has independent clock dividers (on the second page), rate controls, swing controls (these distort the waveform; for the square wave, they change the duty cycle), phase control, shape selection and the option to be used as a bipolar or unipolar LFO.\n\nThere are also two special modes:  Sync watches synchronizes all of the LFO's to LFO 1's clock or rate control.  Quad mode likewise synchronizes to LFO 1's clock or ate, but also disables the phase control and sets the LFOs in quadrature mode.\n\n",
			"controls": "Most of the controls were described in the patch description....\n\nI'll go into a little more detail about some of the buttons.\n\nAlong the left-most column are \"Free\" buttons which allow you to select whether the LFO responds to a clock (clock dividers for each LFO are found on the second page and labeled). or to the rate controls across the top right side.\n\nThere are a row of rate modulation attenuverters; rate modulation can be applied in either clocked or free mode.\n\nThe phase reset buttons determine whether that LFO will respond to phase reset messages received at the input below.\n\nThe track and hold buttons determine whether that LFO will held when the input below goes high.\n\nThe shape button allows you to select between different waveforms for each output (the button will change color and modulate in the fashion of the selected waveform):  orange = square, yellow = sine, green = triangle, aqua = ramp, blue = sawtooth, magenta = random.\n\nWhen the bipolar-unipolar button is low, the output is bipolar (-5 to 5V); when high, it is unipolar (0 to 5V).",
			"btn1": "Tap tempo (will be overriden by clock)",
			"btn2": "Phase reset (applied to all LFOs regardless of phase reset option selected)",
			"cvIn1": "0-10V:  Clock in",
			"cvIn2": "-5-5V:  Rate mod input (with individual attenuverters for each LFO)",
			"cvIn3": "0-10V:  Phase reset input (individually enabled for each LFO)",
			"cvIn4": "0-10V:  Track and hold input (individually enabled for each LFO)",
			"cvOut1": "-5-5V:  LFO 1 out",
			"cvOut2": "-5-5V:  LFO 2 out",
			"cvOut3": "-5-5V:  LFO 3 out",
			"cvOut4": "-5-5V:  LFO 4 out",
			"midi": "N/a",
			"audioIn1": "N/a",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		},
		{
			"num": "56",
			"name": "Boolean foolin'",
			"type": "Utility",
			"shortDesc": "3-input Boolean logic",
			"longDesc": "A super-logic utility that applies logic functions -- OR, AND, NOR, NAND, XOR, XNOR -- to two or three inputs.  There are two available logic matrices for these inputs, as well as a third which applies logic to the outputs of the other matrices.\n\nEach input also offers separate options:  input 1 can be window comparated, with a high and low threshold, input 2 can be set as a NOT input (low when it goes high and vice versa), and input 3 can be comparated, with a threshold, or used to modulate logic matrix 1.  (This will also disable the input, if it is not in use.)\n\nThere is also a flip flopped output, which will divide input 1, input 2, input 3, logic matrix 1, logic matrix 2, or the 1&2 logic matrix.\n\n",
			"controls": "Across the top is a display that allows you to select which logic operation you want to apply for the corresponding output.  The 1-2 output will depend on what is selected for the first two matrices.\n\nThe controls for the inputs are across the bottom; it should be noted that clock filtering on input 2 makes it more amenable to gates than other modulation sources (but it can still be used for other sources; they will just be automatically comparated via the filter).\n\nIn the bottom right corner are the controls for the flip flopped output:  the button on top selects the source (yellow = input 1, green = input 2, aqua = input 3, blue = logic matrix 1, purple = logic matrix 2, pink = logic matrix 1-2); the pushbutton below will select when it is divided by 2 or 4.\n\n",
			"btn1": "N/a",
			"btn2": "N/a",
			"cvIn1": "0-10V:  Input 1",
			"cvIn2": "0-10V:  Input 2",
			"cvIn3": "0-10V:  Input 3",
			"cvIn4": "-5-5V: Mod logic 1 (with attenuverter; this can be used to modulate between different logic operations)",
			"cvOut1": "0-10V:  Logic 1 output",
			"cvOut2": "0-10V:  Logic 2 output",
			"cvOut3": "0-10V:  Logic 1-2 output",
			"cvOut4": "0-10V:  Flip flopped output",
			"midi": "",
			"audioIn1": "",
			"audioIn2": "",
			"audioOut1": "",
			"audioOut2": "",
			"author": "Christopher Jacques"
		},
		{
			"num": "57",
			"name": "LFO Matrix",
			"type": "Utility",
			"shortDesc": "LFO Bank",
			"longDesc": "Mix multiple LFOs, combine them with a ratcheting sequence for glitchy stutters.  Designed for live use.  ",
			"controls": "Global attenuverters on the top left, individual mutes for each LFO, Global mutes on bottom right of control page. ",
			"btn1": "Tap tempo",
			"btn2": "N/a",
			"cvIn1": "0-10V:  phase reset",
			"cvIn2": "N/a",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "-5 to 5V:  LFO out 1",
			"cvOut2": "-5 to 5V:  LFO out 2",
			"cvOut3": "0-10V:  LFO out 3",
			"cvOut4": "0-10V:  LFO out 4",
			"midi": "In",
			"audioIn1": "In",
			"audioIn2": "Out",
			"audioOut1": "Out",
			"audioOut2": "Christopher Jacques",
			"author": "Mitch Lantz"
		},
		{
			"num": "58",
			"name": "NOISEY BUG",
			"type": "Utility",
			"shortDesc": "S&H and CV looper. Sound Source: White/pink noise.",
			"longDesc": "CV utilities generated from an input source or envelope follower (audio input 1). White/pink noise outputs. CV looper for pseudo-random output.",
			"controls": "Both noise outputs have attenuator controls (work in tandem with CV ins 3 and 4). Aliaser frequency cutoff for pink noise. External mixer for envelope follower routed to internal S&H.",
			"btn1": "Rec: records CV for loop (latch)",
			"btn2": "Stop: toggles playback for CV looper (latch)",
			"cvIn1": "0-10V: S&H trigger input, includes 2/8 clock filter ",
			"cvIn2": "0-10V: S&H external source",
			"cvIn3": "0-10V: White noise VCA level",
			"cvIn4": "0-10V: Pink noise VCA level",
			"cvOut1": "0-5V: S&H",
			"cvOut2": "0-5V: slewed S&H",
			"cvOut3": "0-5V: CV looper",
			"cvOut4": "0-10V: S&H trigger (from CV in 1)",
			"midi": "N/a",
			"audioIn1": "Input source for envelope-followed CV",
			"audioIn2": "N/a",
			"audioOut1": "White noise out",
			"audioOut2": "Pink noise out",
			"author": "Mike Moger"
		},
		{
			"num": "59",
			"name": "Visualize it!",
			"type": "Utility",
			"shortDesc": "sound visualizer (awesome winamp stuff!!!!)",
			"longDesc": "Using pitch and dynamics, the colors change and spread in a visualizer.  You can control the speed of the spread with clock.",
			"controls": "In the left corners are two controls to adjust the patch:  smoothing will smooth out changes, making it less jittery; range will set the range of the CV detection, which will affect which colors are displayed.",
			"btn1": "Tap tempo (will be overriden by clock)",
			"btn2": "Color shift (switches between a few different approaches to pitch detection)",
			"cvIn1": "0-10V:  Clock",
			"cvIn2": "N/a",
			"cvIn3": "N/a",
			"cvIn4": "N/a",
			"cvOut1": "N/a",
			"cvOut2": "N/a",
			"cvOut3": "N/a",
			"cvOut4": "N/a",
			"midi": "N/a",
			"audioIn1": "Used for pitch and dynamic detection ",
			"audioIn2": "N/a",
			"audioOut1": "N/a",
			"audioOut2": "N/a",
			"author": "Christopher Jacques"
		}
	]
}
